nagyjose/DP/Kontrola_Syst/STM32_WPAN/App/flash_logger.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
 * @file    flash_logger.h
 * @author  Josef Nagy
 * @brief
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 Josef Nagy.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

#ifndef FLASH_LOGGER_H
#define FLASH_LOGGER_H

#include "stm32wbxx_hal.h"
#include "app_conf.h"
#include <stdbool.h>

// Stejné adresy jako u Závodníka (zbylo 159 volných stránek)
#define LOGGER_START_ADDR       0x08021000
#define LOGGER_PAGE_SIZE        4096
#define LOGGER_MAX_PAGES        159 
#define LOGGER_MAX_RECORDS_PP   (LOGGER_PAGE_SIZE / 8) // 512 záznamů

// 8 bytová struktura pro kontrolu
typedef union {
    uint64_t double_word;
    struct {
        uint8_t  id_bytes[3]; // 3 byty: ID Závodníka
        uint8_t  sub_seconds; // 1 byte: Zlomky vteřiny
        uint32_t unix_time;   // 4 byty: Čas oražení z RTC
    } __attribute__((packed)) data;
} ControlRecord_t;

void Logger_Init(void);
void Config_Init(void);
void Logger_SavePunch_Kontrola(uint8_t* id_3bytes, uint8_t sub_sec, uint32_t unix_time);
void Logger_GetDownloadData(uint8_t cmd, uint32_t param, uint8_t **start_ptr, uint32_t *len);
void Logger_FormatAll(void);
void Config_Commit(BeaconConfig_t *new_cfg); // Změněno na BeaconConfig_t!
void Config_EraseAndReboot(void);
void System_FactoryResetAll(void);

#endif /* FLASH_LOGGER_H */
